In [1]:
import pandas as pd

In [6]:
%config Completer.use_jedi = False
import numpy as np

In [2]:
veri_seti = pd.read_csv(
    "https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/fa71405126017e6a37bea592440b4bee94bf7b9e/titanic.csv"
)

In [3]:
veri_seti.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
cinsiyet = pd.get_dummies(veri_seti.Sex, drop_first=True)

In [5]:
cinsiyet.head()

   male
0     1
1     0
2     0
3     0
4     1

In [7]:
veri_seti.Sex.head()

0      male
1    female
2    female
3    female
4      male
Name: Sex, dtype: object

In [ ]:
# ikili değişkenler haline getirme

In [8]:
# Embarked özelliğinin ilk 5 değeri
veri_seti.Embarked.head()

0    S
1    C
2    S
3    S
4    S
Name: Embarked, dtype: object

In [9]:
# kukla değişkenler ile birlikte
pd.get_dummies(veri_seti.Embarked).head()

   C  Q  S
0  0  0  1
1  1  0  0
2  0  0  1
3  0  0  1
4  0  0  1

In [3]:
kelime_dizisi = ["Veri Madenciliği Dersine Hoş Geldiniz"]
kelime_serisi = pd.Series(kelime_dizisi)

In [4]:
import numpy as np

In [ ]:
np.a